Revit 2027 API
ParameterTypeId.RbsElecCircuitNumberingType Property
 "Circuit Numbering Option"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecCircuitNumberingType { get; }
Public Shared ReadOnly Property RbsElecCircuitNumberingType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecCircuitNumberingType {
	ForgeTypeId^ get ();
}
static member RbsElecCircuitNumberingType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace